---
layout: post
title: "neo4j随笔-将csv文件导入知识图谱"
date: 2025-03-09 10:51:45 +0800
description: "我有两个csv文件nodes1.1.csv存放节点信息,用记事本打开，能正常显示，且编码为UTF-8，就可以。虽然在excel表打开是乱码relations1.1.csv存放节点信息,用记事本打开，能正常显示，且编码为UTF-8，就可以。虽然在excel表打开是乱码然后将这两个csv文件放到neo4j的import目录下（linux的neo4j在/var/lib/neo4j/import）因为我们还有通过节点信息动态生成节点标签，也要通过关系信息动态生成关系标签，所以需要安装apoc插件。"
keywords: "neo4j随笔-将csv文件导入知识图谱"
categories: ['Neo']
tags: ['Neo']
artid: "146117880"
image:
    path: https://api.vvhan.com/api/bing?rand=sj&artid=146117880
    alt: "neo4j随笔-将csv文件导入知识图谱"
render_with_liquid: false
featuredImage: https://bing.ee123.net/img/rand?artid=146117880
featuredImagePreview: https://bing.ee123.net/img/rand?artid=146117880
cover: https://bing.ee123.net/img/rand?artid=146117880
image: https://bing.ee123.net/img/rand?artid=146117880
img: https://bing.ee123.net/img/rand?artid=146117880
---

<div class="blog-content-box">
 <div class="article-header-box">
  <div class="article-header">
   <div class="article-title-box">
    <h1 class="title-article" id="articleContentId">
     neo4j随笔-将csv文件导入知识图谱
    </h1>
   </div>
  </div>
 </div>
 <article class="baidu_pl">
  <div class="article_content clearfix" id="article_content">
   <link href="../../assets/css/kdoc_html_views-1a98987dfd.css" rel="stylesheet"/>
   <link href="../../assets/css/ck_htmledit_views-704d5b9767.css" rel="stylesheet"/>
   <div class="htmledit_views" id="content_views">
    <hr id="hr-toc" name="tableOfContents"/>
    <p>
    </p>
    <h2 id="%E5%AF%BC%E5%85%A5%E5%89%8D%E7%9A%84%E5%87%86%E5%A4%87" name="%E5%AF%BC%E5%85%A5%E5%89%8D%E7%9A%84%E5%87%86%E5%A4%87">
     导入前的准备
    </h2>
    <p>
     我有两个csv文件
    </p>
    <p>
     <img alt="" height="95" src="https://i-blog.csdnimg.cn/direct/d981531d0ca3422dba5ff38a84042b6a.png" width="332"/>
    </p>
    <p>
     nodes1.1.csv存放节点信息,用记事本打开，能正常显示，且编码为UTF-8，就可以使用。
     <span style="color:#fe2c24">
      虽然在excel表打开是乱码
     </span>
    </p>
    <p>
     <img alt="" height="551" src="https://i-blog.csdnimg.cn/direct/0c15c1704cf84cc3bf6811474caaa55c.png" width="853"/>
    </p>
    <p>
     relations1.1.csv存放节点信息,用记事本打开，能正常显示，且编码为UTF-8，就可以使用。
     <span style="color:#fe2c24">
      虽然在excel表打开是乱码
     </span>
    </p>
    <p>
     <img alt="" height="540" src="https://i-blog.csdnimg.cn/direct/e07c7e21f922449ab311b296d6f884b2.png" width="858"/>
    </p>
    <p>
     然后将这两个csv文件放到neo4j的import目录下（linux的neo4j在/var/lib/neo4j/import）
    </p>
    <p>
     <img alt="" height="354" src="https://i-blog.csdnimg.cn/direct/70ba0374ce664dd9aa992622e73b918f.png" width="1382"/>
    </p>
    <p>
     因为我们还要通过节点信息动态生成节点标签，也要通过关系信息动态生成关系标签，所以需要安装apoc插件。
    </p>
    <p>
     可以看这位博主的博客：
     <a href="https://blog.csdn.net/qq_46449373/article/details/145307571" title="2025最新Neo4j安装apoc插件-CSDN博客">
      2025最新Neo4j安装apoc插件-CSDN博客
     </a>
    </p>
    <h2 id="%E5%AF%BC%E5%85%A5csv%E6%96%87%E4%BB%B6" name="%E5%AF%BC%E5%85%A5csv%E6%96%87%E4%BB%B6">
     导入csv文件
    </h2>
    <p>
     插件安装完毕后，就可以打开网页版neo4j
    </p>
    <p>
     <img alt="" height="923" src="https://i-blog.csdnimg.cn/direct/311b24e21f8b44c588a57654ad6e5259.png" width="1860"/>
    </p>
    <p>
     执行Cypher语句
    </p>
    <h3 id="%E5%AF%BC%E5%85%A5nodes1.1.csv%E5%B9%B6%E5%8A%A8%E6%80%81%E4%B8%BA%E8%8A%82%E7%82%B9%E6%B7%BB%E5%8A%A0%E6%A0%87%E7%AD%BE" name="%E5%AF%BC%E5%85%A5nodes1.1.csv%E5%B9%B6%E5%8A%A8%E6%80%81%E4%B8%BA%E8%8A%82%E7%82%B9%E6%B7%BB%E5%8A%A0%E6%A0%87%E7%AD%BE">
     导入nodes1.1.csv并动态为节点添加标签
    </h3>
    <pre><code class="hljs">LOAD CSV WITH HEADERS FROM 'file:///nodes1.1.csv' AS row
MERGE (n:Node {id: row.id})
SET n.name = row.name, 
    n.type = row.type, 
    n.description = row.description, 
    n.expression = row.expression
WITH n, row
CALL apoc.create.addLabels(n, [row.type]) YIELD node  // 动态为节点添加标签
RETURN node;
</code></pre>
    <h3 id="%E2%80%8B%E7%BC%96%E8%BE%91%E5%AF%BC%E5%85%A5relations1.1.csv%E5%8A%A8%E6%80%81%E4%B8%BA%E5%85%B3%E7%B3%BB%E6%B7%BB%E5%8A%A0%E6%A0%87%E7%AD%BE" name="%E2%80%8B%E7%BC%96%E8%BE%91%E5%AF%BC%E5%85%A5relations1.1.csv%E5%8A%A8%E6%80%81%E4%B8%BA%E5%85%B3%E7%B3%BB%E6%B7%BB%E5%8A%A0%E6%A0%87%E7%AD%BE">
     <img alt="" height="866" src="https://i-blog.csdnimg.cn/direct/c0d7123786884102a56bbcc182e3b2eb.png" width="1751">
      <br/>
      导入relations1.1.csv并动态为关系添加标签
     </img>
    </h3>
    <pre><code class="hljs">LOAD CSV WITH HEADERS FROM 'file:///relations1.1.csv' AS row
MATCH (source:Node {id: row.source_id})
MATCH (target:Node {id: row.target_id})
CALL apoc.merge.relationship(source, row.relation, {}, {}, target) YIELD rel
RETURN rel;
</code></pre>
    <p>
     <img alt="" height="692" src="https://i-blog.csdnimg.cn/direct/899273d2673640cf804b5bf1dd9031c7.png" width="1752"/>
    </p>
    <h2 id="%E7%BB%93%E6%9E%9C" name="%E7%BB%93%E6%9E%9C">
     结果
    </h2>
    <p>
     顺利导入
    </p>
    <p>
     <img alt="" height="796" src="https://i-blog.csdnimg.cn/direct/95ae85be7f9440628ea4e0c931892b2b.png" width="1772"/>
    </p>
   </div>
  </div>
 </article>
 <p alt="68747470733a2f2f62:6c6f672e6373646e2e6e65742f6d305f37343436323333392f:61727469636c652f64657461696c732f313436313137383830" class_="artid" style="display:none">
 </p>
</div>


