---
layout: post
title: "计算机三级网络技术知识点汇总7"
date: 2025-03-08 11:05:28 +0800
description: "路由器是工作在网络层的设备，负责将数据分组从源端主机经最佳路径传送到目的端主机，实现在网络层的互联。路由器工作在 TCP/IP 网络模型的网络层，对应于 OSI 网络参考模型的第三层，因此，路由器也常称为网络层互 联设备。路由器是互联网的主要节点设备。路由器通过路由决定数据的转发，转发策略称为路由选择（routing），这也 是路由器名称的由来（router，转发者）。"
keywords: "计算机三级网络技术知识点汇总【7】"
categories: ['计算机三级网络技术']
tags: ['智能路由器']
artid: "146112843"
image:
    path: https://api.vvhan.com/api/bing?rand=sj&artid=146112843
    alt: "计算机三级网络技术知识点汇总7"
render_with_liquid: false
featuredImage: https://bing.ee123.net/img/rand?artid=146112843
featuredImagePreview: https://bing.ee123.net/img/rand?artid=146112843
cover: https://bing.ee123.net/img/rand?artid=146112843
image: https://bing.ee123.net/img/rand?artid=146112843
img: https://bing.ee123.net/img/rand?artid=146112843
---

<div class="blog-content-box">
 <div class="article-header-box">
  <div class="article-header">
   <div class="article-title-box">
    <h1 class="title-article" id="articleContentId">
     计算机三级网络技术知识点汇总【7】
    </h1>
   </div>
  </div>
 </div>
 <article class="baidu_pl">
  <div class="article_content clearfix" id="article_content">
   <link href="../../assets/css/kdoc_html_views-1a98987dfd.css" rel="stylesheet"/>
   <link href="../../assets/css/ck_htmledit_views-704d5b9767.css" rel="stylesheet"/>
   <div class="markdown_views prism-tomorrow-night" id="content_views">
    <svg style="display: none;" xmlns="http://www.w3.org/2000/svg">
     <path d="M5,0 0,2.5 5,5z" id="raphael-marker-block" stroke-linecap="round" style="-webkit-tap-highlight-color: rgba(0, 0, 0, 0);">
     </path>
    </svg>
    <h2>
     <a id="__0">
     </a>
     第七章 路由器配置及使用
    </h2>
    <h3>
     <a id="1__2">
     </a>
     1. 路由器的基础知识
    </h3>
    <h4>
     <a id="11__4">
     </a>
     1.1
     <strong>
      路由器的基本概念
     </strong>
    </h4>
    <p>
     路由器是工作在网络层的设备，负责将数据分组从源端主机经最佳路径传送到目的端主机，实现在网络层的互联。路由器工作在 TCP/IP 网络模型的网络层，对应于 OSI 网络参考模型的第三层，因此，路由器也常称为网络层互 联设备。
    </p>
    <p>
     路由器是互联网的主要节点设备。路由器通过路由决定数据的转发，转发策略称为路由选择（routing），这也 是路由器名称的由来（router，转发者）。
    </p>
    <h4>
     <a id="12__10">
     </a>
     1.2
     <strong>
      路由器的结构
     </strong>
    </h4>
    <p>
     路由器有硬件和软件组成，路由器软件主要由路由器的操作系统（互联网操作系统组成），用于控制和实现路由 器的全部功能。
    </p>
    <p>
     路由器硬件组成部分有：
     <strong>
      中央处理器（CPU）、内存（Memory）、存储器（Storage）、接口（Interface）
     </strong>
     ；
    </p>
    <p>
     （1）
     <strong>
      中央处理器 CPU 是路由器的心脏
     </strong>
     ，是路由器的处理中心，负责实现路由协议，路径选择计算、交换路由信息、查找路由表、分发路由表和维护各种表格，以及转发数据包等功能。CPU 的能力直接影响路由器的路由表查找时间、吞吐量和路 由器的性能。
    </p>
    <p>
     （2）内存
    </p>
    <p>
     路由器内存用于保存路由器配置、路由器操作系统、路由协议软件等。
    </p>
    <p>
     主要的类型有：
     <strong>
      只读内存（ROM）、随机存储器（RAM）、非易失性随机存储器（NVRAM）和闪存（Flash）
     </strong>
     。
    </p>
    <p>
     ① 只读内存（ROM）
    </p>
    <p>
     <strong>
      用来永久保存路由器的开机诊断程序、引导程序和操作系统软件
     </strong>
    </p>
    <p>
     ROM 的主要任务是完成路由器的初始化进程，具体包括路由器启动时硬件诊断、装入路由器操作系统 IOS 等
    </p>
    <p>
     <strong>
      ROM 是只读存储器，不能修改其中保存的内容
     </strong>
     。
    </p>
    <p>
     ② 随机存储器（RAM）
    </p>
    <p>
     <strong>
      是可读可写存储器
     </strong>
    </p>
    <p>
     在路由器操作系统运行期间，
     <strong>
      RAM 主要存储路由表、快速交换缓存、ARP 缓存、数据分组缓冲区和缓存队列、 运行配置文件，以及正在执行的代码和一些临时数据信息
     </strong>
     等。
    </p>
    <p>
     在关机和重启路由器之后，
     <strong>
      RAM 里的数据会自动丢失
     </strong>
     。
    </p>
    <p>
     ③ 非易失性随机存储器（NVRAM）
    </p>
    <p>
     也是一个可读可写存储器
    </p>
    <p>
     <strong>
      主要用于存储启动配置文件（startup-config）或备份配置文件
     </strong>
    </p>
    <p>
     NVRAM 容量较小，通常存储量只有 32KB~128KB，但是存取速度非常快，而且保存的数据不会丢失。
    </p>
    <p>
     ④ 闪存（Flash）
    </p>
    <p>
     是可擦写的 ROM，
     <strong>
      主要用于存储路由器当前使用的操作系统映像文件和一些微代码
     </strong>
     。
    </p>
    <p>
     闪存的容量比较大，可以用来保存备份的配置文件，也不丢失保存数据。
    </p>
    <h3>
     <a id="2__54">
     </a>
     2.
     <strong>
      路由器的工作原理
     </strong>
    </h3>
    <h4>
     <a id="21__56">
     </a>
     2.1
     <strong>
      路由选择
     </strong>
    </h4>
    <p>
     路由选择就是路由器根据目的 IP 地址的网络地址部分，通过路由选择算法确定一条从源结点到目的结点的最佳路径。
    </p>
    <p>
     <img alt="在这里插入图片描述" src="https://i-blog.csdnimg.cn/direct/6afe3183a7e64ed9b283bcec05a3104d.png"/>
    </p>
    <h4>
     <a id="22__63">
     </a>
     2.2
     <strong>
      分组转发
     </strong>
    </h4>
    <p>
     分组转发主要完成按照路由选择所指出的最佳路由将数据分组从源节点转发到目的结点。路由器在接收到一个 数据分组时，首先查看数据分组头中的目的 IP 地址字段，根据目的 IP 地址的网络地址部分去查询路由表。
    </p>
    <p>
     <img alt="在这里插入图片描述" src="https://i-blog.csdnimg.cn/direct/7bde91e8a7b24cceac8e326878c54c01.png"/>
    </p>
    <p>
     注意：在数据分组通过每一个路由器转发时，分组中的
     <strong>
      目的 MAC 地址是变化
     </strong>
     的，但是它的
     <strong>
      目的网络地址始终不变
     </strong>
     。
    </p>
    <p>
     目的IP地址直接看最下面的IP地址为211.68.69.254对于每一个数据包来说都是固定不变的，对于每个数据包的目的MAC地址来说就是指向下一个路由器的MAC地址。
    </p>
    <p>
     2.3
     <strong>
      路由表
     </strong>
    </p>
    <p>
     路由表中记录着所有路由信息，路由表的内容主要包括目的网络地址及其所对应的目的端口或下一跳路由器地 址或缺省路由的信息。
    </p>
    <p>
     Cateway of last resirt is not set
    </p>
    <p>
     ​ 10.0.0.0/8 is variably subnetted,2 subnets,2 masks
    </p>
    <p>
     C 10.1.1.0/24 is directly connected,GigabitEthernet0/1
    </p>
    <p>
     L 10.1.1.1/32 is directly connected,GigabitEthernet0/1
    </p>
    <p>
     ​ 192.168.1.0/24 is variably subnetted,2 subnets,2 masks
    </p>
    <p>
     C 192.168.1.0/24 is directly connected,GigabitEthernet0/0
    </p>
    <p>
     L 192.168.1.1/32 is directly connected,GigabitEthernet0/0
    </p>
    <p>
     S 202.33.3.0/24 [1/0] via 10.1.1.2
    </p>
    <p>
     三层交换机：
    </p>
    <p>
     C 202.112.38.16 is directly connected,POS3/0
    </p>
    <p>
     O E1 202.112.38.72 [110/21] via 202.112.62.242,2w6d,vlan62
    </p>
    <p>
     S 202.112.236.0/24 [1/0] via 202.112.41.8
    </p>
    <p>
     O E2 202.205.255.0/24 [110/20] via 202.112.62.242,7w0d,vlan255
    </p>
    <p>
     162.105.0.0/16 is variably subnetted,209 subnets,4 masks
    </p>
    <p>
     O 162.105.139.64/26 [110/3] via 162.105.250.118,10:35:25,vlan250
    </p>
    <p>
     B 168.160.0.0/16 [200/70] via 202.112.63.254,1w0d
    </p>
    <p>
     B 210.74.144.0/24 [200/70] via 202.112.63.254,1w0d
    </p>
    <p>
     S* 0.0.0.0/0 [1/0] via 202.112.38.17
    </p>
    <ul>
     <li>
      第 1 列表示路由表项的来源，标识这个路由表项是通过什么方式或者通过何种路由选择协议建立的。
     </li>
    </ul>
    <p>
     ​ “C”表示直连路由（conected），表示目的网络直接与路由器端口相连；
    </p>
    <p>
     ​ “S”表示为静态（static）路由；
     <strong>
      S*是缺省路由，0.0.0.0/0
     </strong>
    </p>
    <p>
     ​ “I”表示使用 IGRP 内部网关路由协议学习到的路由信息；
    </p>
    <p>
     ​ “O”表示使用 OSPF 开放最短路径优先协议学习到的路由信息；
    </p>
    <ul>
     <li>
      <p>
       第 2 列表示的是目的网络的地址和掩码长度；
      </p>
     </li>
     <li>
      <p>
       第 3 列表示目的端口或者下一跳路由器的地址；
      </p>
     </li>
     <li>
      <p>
       “[]”中的前半部分为管理距离，后半部分为权值；
      </p>
     </li>
    </ul>
    <table>
     <thead>
      <tr>
       <th>
        路由信息源
       </th>
       <th>
        管理距离值
       </th>
      </tr>
     </thead>
     <tbody>
      <tr>
       <td>
        直接连接（S）
       </td>
       <td>
        0
       </td>
      </tr>
      <tr>
       <td>
        静态路由（S）
       </td>
       <td>
        1
       </td>
      </tr>
      <tr>
       <td>
        IGRP（I）
       </td>
       <td>
        100
       </td>
      </tr>
      <tr>
       <td>
        OSPF（O）
       </td>
       <td>
        110
       </td>
      </tr>
      <tr>
       <td>
        IS-IS
       </td>
       <td>
        115
       </td>
      </tr>
      <tr>
       <td>
        RIP
       </td>
       <td>
        120
       </td>
      </tr>
      <tr>
       <td>
        内部 BGP
       </td>
       <td>
        200
       </td>
      </tr>
     </tbody>
    </table>
    <p>
     **注意：**在包含多种信息源的时候，根据缺省的管理距离值越小，路由信息源的可信度越高，一般则选择该选项。
    </p>
    <p>
     <strong>
      补充：路由表解题技巧
     </strong>
    </p>
    <p>
     路由表【解题技巧】
    </p>
    <p>
     Gateway of last resort is
     <u>
      192.168.1.254
     </u>
     to network 0.0.0.0
    </p>
    <ul>
     <li>
      <p>
       C 192.168.2.0/24 is directly connected,
       <u>
        FastEthernet 0/1 (端口名)
       </u>
      </p>
     </li>
     <li>
      <p>
       192.168.3.0/30 is subnetted, 1 subnets
      </p>
     </li>
     <li>
      <p>
       S * 0.0.0.0/0
       <u>
        [1/0]
       </u>
       via 192.168.1.254
      </p>
     </li>
     <li>
      <p>
       S 210.202.60.0/20 [1/0] via
       <u>
        192.168.1.254
       </u>
      </p>
     </li>
     <li>
      <p>
       S 211.210.16.0/21 [1/6] via
       <u>
        192.168.2.254
       </u>
      </p>
     </li>
     <li>
      <p>
       S 202.76.0.0/20 [1/0] via
       <u>
        192.168.3.254
       </u>
      </p>
     </li>
    </ul>
    <p>
     出题点：
    </p>
    <p>
     <strong>
      connected+端口名【如果是三层交换机，connected+虚拟局域网】
     </strong>
    </p>
    <p>
     <strong>
      via+目标的网络（IP地址）
     </strong>
    </p>
    <p>
     <strong>
      S（静态路由）后面跟具体的IP地址，不是网络地址
     </strong>
    </p>
    <p>
     <strong>
      管理距离值
     </strong>
    </p>
    <p>
     判断路由表正确标准：
    </p>
    <p>
     路由器后跟端口名（eg:POS3/0）：三层交换机后跟虚拟局域网号（eg:Vlan2）；
    </p>
    <p>
     via+具体 IP（169.28.159.10）；
    </p>
    <p>
     静态路由后面不跟网络地址（eg：162.105.239.0\25）
    </p>
    <p>
     管理距离值对应是否正确。（如上表所示）
    </p>
    <h4>
     <a id="24__178">
     </a>
     2.4
     <strong>
      路由器的工作模式
     </strong>
    </h4>
    <h5>
     <a id="241_RouteruUser_EXECu_180">
     </a>
     2.4.1 用户模式：Router&gt;（
     <u>
      User EXEC
     </u>
     ）
    </h5>
    <p>
     在该模式下，用户只能运行少数的命令（如 ping、show version、telnet 等），有限度地查看路由器的相关信息， 但不能对路由器的配置做任何修改，也不能查看路由器的配置信息，只能对路由器做一些简单的操作，因而它是一个
     <strong>
      只读模式
     </strong>
     。
    </p>
    <h5>
     <a id="242_RouteruPrivileged_EXECu_184">
     </a>
     2.4.2 特权模式：Router#（
     <u>
      Privileged EXEC
     </u>
     ）
    </h5>
    <p>
     在用户模式下，输入“
     <strong>
      enable
     </strong>
     ”命令后按回车键，即可进入超级权限模式（如果设置了口令，还需要在回车后 按提升输入口令）。该模式下，最常用的操作包括管理系统时钟、进行错误检测、查看和保存配置文件、清除闪存、 处理并完成路由器的冷启动等操作。
    </p>
    <h5>
     <a id="243_Routerconfig_uGlobal_Configurationu_188">
     </a>
     2.4.3 全局配置模式：Router(config)# （
     <u>
      Global Configuration
     </u>
     ）
    </h5>
    <p>
     在特权模式下，输入“
     <strong>
      config terminal
     </strong>
     ”命令后回车，即可以进入全局配置模式。全局配置模式用于配置路由器 的全局性参数（主机名，口令，TFTP 服务器，静态路由，访问控制列表等）
    </p>
    <h5>
     <a id="244__192">
     </a>
     2.4.4 其他配置模式
    </h5>
    <p>
     包括接口配置模式、虚拟终端配置模式、路由协议配置模式
    </p>
    <p>
     接口配置模式：Router(config)#interface f0/1
     <strong>
      Router(config-if)#
     </strong>
    </p>
    <p>
     虚拟终端配置模式：Router(config)#line vty 0 15
     <strong>
      Router(config-line)#
     </strong>
    </p>
    <p>
     路由协议配置模式：Router(config)#router ospf
     <strong>
      Router(config-router)#
     </strong>
    </p>
    <h5>
     <a id="245_uRXBOOTu__202">
     </a>
     <strong>
      2.4.5
      <u>
       RXBOOT
      </u>
      模式：
     </strong>
    </h5>
    <p>
     当密码丢失时，可以从该模式下恢复，因此该模式是路由器的维护模式。
    </p>
    <h5>
     <a id="246_uSETUPu_206">
     </a>
     2.4.6
     <u>
      设置（SETUP）模式
     </u>
    </h5>
    <p>
     在任何时候，要进入设置模式，在特权模式下，输入 setup 即可。
    </p>
    <p>
     新路由器第一次进行配置时，系统会自动进入设置模式，并询问是否采用该方式进行配置。
    </p>
    <h3>
     <a id="3__214">
     </a>
     3.
     <strong>
      路由器的基本配置及常用命令
     </strong>
    </h3>
    <h4>
     <a id="31__216">
     </a>
     3.1
     <strong>
      路由器的配置方式
     </strong>
    </h4>
    <ul>
     <li>
      <p>
       通过控制端口（
       <strong>
        Console
       </strong>
       ）进行配置管理。
      </p>
     </li>
     <li>
      <p>
       使用
       <strong>
        telnet 远程登陆配置
       </strong>
       ，即使用 telnet 远程登陆到路由器上进行配置管理。
      </p>
     </li>
     <li>
      <p>
       使用
       <strong>
        TFTP 服务
       </strong>
       ，以复制配置文件、修改配置文件的形式配置路由器。
      </p>
     </li>
     <li>
      <p>
       在
       <strong>
        AUX 端口连接一台 Modem
       </strong>
       ，在远端拨号配置路由器。
      </p>
     </li>
     <li>
      <p>
       使用
       <strong>
        网络管理协议 SNMP 修改路由器配置文件
       </strong>
       的方式，对路由器进行配置。
      </p>
     </li>
    </ul>
    <h4>
     <a id="32__228">
     </a>
     3.2
     <strong>
      路由器的基本配置
     </strong>
    </h4>
    <p>
     路由器的基本配置一般都是通过使用 Console 端口配置方式完成，配置的内容主要包括配置路由器的主机名、 超级用户口令和远程登陆口令等，包括网络的基本检测命令和配置文件的保存命令。
    </p>
    <p>
     （1）配置路由器的主机名
    </p>
    <p>
     在全局配置模式下：
    </p>
    <p>
     Router(config)#
     <strong>
      hostname
     </strong>
    </p>
    <p>
     Router-xh Router-xh(config)#
    </p>
    <p>
     （2）配置超级用户口令
    </p>
    <p>
     Router-xh#configure terminal Router-xh(config)#enable secret xueba（设置超级用户明码密码）
    </p>
    <p>
     Router-xh(config)#enable password 7 xueba123（设置超级用户加密密码）
    </p>
    <p>
     Router-xh(config)#
    </p>
    <p>
     （3）设置系统时钟
    </p>
    <p>
     命令格式：calendar set hh:mm:ss &lt;1-31&gt; MONTH &lt;1993-2035&gt;
     <strong>
      （时：分：秒 日 月 年）
     </strong>
    </p>
    <p>
     Router-xh# calendar set 20:26:00 3 march 2023
    </p>
    <h4>
     <a id="33__254">
     </a>
     3.3
     <strong>
      路由器常用命令
     </strong>
    </h4>
    <p>
     （1）退出命令
    </p>
    <p>
     无论是从端口模式退出，返回全局配置模式，还是从全局配置模式退出返回特权用户模式，都可以使用 exit 命令
     <strong>
      一级一级地退出
     </strong>
     ，也可以使用 end 命令，
     <strong>
      直接退回到特权用户模式
     </strong>
     ； Router-xh(config-if) # exit
    </p>
    <p>
     Router-xh(config) #exit
    </p>
    <p>
     Router-xh #
    </p>
    <p>
     Router-xh(config-if) #end
    </p>
    <p>
     Router-xh #
    </p>
    <p>
     （2）保存配置
    </p>
    <p>
     当完成路由器配置，需要保存配置时，可以在特权用户模式下，使用 writer 命令
    </p>
    <p>
     Router-xh&gt;en（ 进入特权用户 模式）
    </p>
    <p>
     Router-xh#
     <u>
      write memory
     </u>
     <strong>
      （保存路由器配置到 NVRAM 中）
     </strong>
    </p>
    <p>
     Router-xh# write network tftp（保存到 TFTP 服务器中）
    </p>
    <p>
     若要删除路由器的全部配置，也可以在特权用户模式下，使用 write 命令。
    </p>
    <p>
     Router-xh#
     <u>
      wirte erase
     </u>
     <strong>
      （清除配置文件）
     </strong>
    </p>
    <p>
     （3）网络的基本检测命令
    </p>
    <p>
     <strong>
      ping 命令
     </strong>
     使用 echo 协议，通过向目标主机发送数据包，根据目标主机的应答情况，来了解路径的可靠性、链 路的延迟时间和目的主机是否可以到达，从而判别到目标网络的连通情况。
    </p>
    <p>
     <strong>
      trace 命令
     </strong>
     是一个实用的网络诊断工具，它不仅能诊断到目的网络的连通性，还能跟踪到目标网络转发路径上每 一级路由器的工作状况、延迟时间（最多 30 跳，超过则视为不可达）等。
    </p>
    <p>
     <strong>
      telnet 命令
     </strong>
     在进行网络诊断时，需要经常登录到不同路由器上进行查看。一般路由器可支持 5 个 telnet 同时连 接。该命令可在用户模式或特权用户模式下使用。
    </p>
    <p>
     （4）show 命令
    </p>
    <p>
     可以查看到路由器的配置情况、接口的工作状态、路由表信息、路由器软硬件版本、路由器资源的利用情况和 各种协议工作信息等。
    </p>
    <p>
     该命令可以在用户模式下或特权用户模式下运行，但不同模式下可以查看的信息不同；
    </p>
    <p>
     在用户模式下可以查看路由器系统的软硬件版本、系统时钟、flash 的使用情况等；
    </p>
    <p>
     在特权用户模式下，则能够查看路由器配置、路由表信息、IP 的相关信息以及 IP 协议的统计信息等；
    </p>
    <p>
     （5）查看 flash 存储器信息及存储器中的文件。
    </p>
    <p>
     <strong>
      Router-xh&gt;show flash
     </strong>
    </p>
    <p>
     System flash directory:
    </p>
    <p>
     <strong>
      File Length Name/status
     </strong>
    </p>
    <p>
     3 33591768 c2900-universalk9-mz.SPA.151-4.M4.bin
    </p>
    <p>
     2 28282 sigdef-category.xml
    </p>
    <p>
     1 227537 sigdef-default.xml
    </p>
    <p>
     [33847587 bytes used,221896413 available,255744000 total]
    </p>
    <p>
     249856K bytes of processor borad System flash(Read/Write)
    </p>
    <p>
     Router-xh&gt;
    </p>
    <p>
     （6）查看系统时钟。
    </p>
    <p>
     <strong>
      Router-xh&gt;show clock
     </strong>
    </p>
    <p>
     *2:25:43.514 UTC Mon Mar1 1993
    </p>
    <p>
     Router-xh&gt;
    </p>
    <p>
     （7）查看路由器配置文件
    </p>
    <p>
     <strong>
      Router-xh# show configuration
     </strong>
    </p>
    <p>
     Using 6079 out of 32762 bytes
    </p>
    <p>
     !
    </p>
    <p>
     Version 12.2
    </p>
    <p>
     (----------------------------------省略多余配置信息)
    </p>
    <p>
     Router-xh
    </p>
    <p>
     （8）查看路由表
    </p>
    <p>
     <strong>
      Router-xh # show ip route
     </strong>
    </p>
    <p>
     Gateway of last resort is not set C 192.168.1.0/24 is directly connected,FastEtherent0/0
    </p>
    <p>
     Router-xh #
    </p>
    <p>
     （9）查看 IP 路由协议信息。
    </p>
    <p>
     <strong>
      Router-xh # show ip protocols
     </strong>
    </p>
    <p>
     <strong>
      Routing Protocol is “rip”
     </strong>
    </p>
    <p>
     Sending updates every 30 seconds,next due in 12 seconds Invalid after 180 seconds,hold down 180,flushed after 240 Outgoing update filter list for all interfaces is not set Incoming update filter list for all interfaces is not set Redistributing:rip
    </p>
    <p>
     Default version control:send version 2,receive 2
    </p>
    <p>
     Interface Send Recv Triggered RIP Key-chain
    </p>
    <h3>
     <a id="4__364">
     </a>
     4.
     <strong>
      路由器的接口配置
     </strong>
    </h3>
    <h4>
     <a id="41__366">
     </a>
     4.1
     <strong>
      路由器接口的基本配置
     </strong>
    </h4>
    <p>
     （1）配置接口描述信息。
    </p>
    <p>
     进入端口配置模式，使用 description 命令：
    </p>
    <p>
     Router-xh(config)# interface f0/1
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      description To-websever
     </strong>
    </p>
    <p>
     Router-xh(config-if) #
    </p>
    <p>
     （2）配置接口带宽。
    </p>
    <p>
     进入接口配置模式，使用 bandwidth 命令设置接口带宽，
     <strong>
      带宽单位是 kbit/s
     </strong>
    </p>
    <p>
     Router-xh(config)# interface f0/1
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      bandwidth 2500000
     </strong>
    </p>
    <p>
     Router-xh(config-if)#
    </p>
    <p>
     （3）配置接口地址。
    </p>
    <p>
     进入接口配置模式，使用 ip address 命令配置接口的 IP 地址。
    </p>
    <p>
     命令格式：
     <strong>
      ip address &lt;地址&gt;&lt;子网掩码&gt;
     </strong>
    </p>
    <p>
     Router-xh(config)#interface f0/1
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      ip address 192.168.1.254 255.255.255.0
     </strong>
    </p>
    <p>
     Router-xh(config-if)#
    </p>
    <p>
     （4）接口的开启与关闭。
    </p>
    <p>
     进入接口配置模式，使用 shutdown、no shutdown 命令关闭和开启接口。
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      shutdown（关闭接口）
     </strong>
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      no shutdown（打开接口）
     </strong>
    </p>
    <p>
     Router-xh(config-if)#
    </p>
    <h4>
     <a id="42__410">
     </a>
     4.2
     <strong>
      局域网接口配置
     </strong>
    </h4>
    <p>
     可配置的局域网技术接口有以太网、FDDI、ATM 和 Token Ring 等。目前以太网应用范围最为广法。
    </p>
    <p>
     （1）配置标准以太网接口（接口类型为 Ethernet，可简写为 e）
    </p>
    <p>
     Router-xh(config)#
     <strong>
      interface Ethernet0
     </strong>
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      description
     </strong>
     To-websever
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      ip address 192.168.1.154 255.255.255.0
     </strong>
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      bandwidth 100000
     </strong>
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      no shutdown
     </strong>
    </p>
    <p>
     Router-xh(config-if)#
    </p>
    <p>
     （2）配置快速以太网（f）或千兆以太网（g）接口
    </p>
    <p>
     Router-xh(config)#
     <strong>
      interface f2/1
     </strong>
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      description
     </strong>
     To-websever
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      ip address 192.168.1.254 255.255.255.0
     </strong>
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      bandwidth 100000
     </strong>
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      duplex full
     </strong>
    </p>
    <p>
     Router-xh(config-if)# no ip directed-broadcast
    </p>
    <p>
     Router-xh(config-if)# np ip proxy-arp
    </p>
    <p>
     Router-xh(config-if)# no shutdown
    </p>
    <h4>
     <a id="43__446">
     </a>
     4.3
     <strong>
      广域网接口配置
     </strong>
    </h4>
    <p>
     （1）配置异步串行接口
    </p>
    <p>
     异步串行接口的接口类型为 Async，可以简写成
     <strong>
      a
     </strong>
     ，Async 接口主要用于 Modem 设备连接，为用户提供拨号上网服务。
    </p>
    <p>
     <strong>
      PPP 协议
     </strong>
     ：主要用于在全双工的
     <strong>
      异步链路
     </strong>
     上进行点到点的数据传输，
     <strong>
      也支持同步串行
     </strong>
     。
    </p>
    <p>
     <strong>
      HDLC 协议
     </strong>
     ：其在
     <strong>
      同步串行
     </strong>
     数据链路上封装数据，最常用于点到点链接。
    </p>
    <p>
     接口配置如下：
    </p>
    <p>
     Router-xh(config)#
     <strong>
      interface a1
     </strong>
    </p>
    <p>
     Router-xh(config-if)# ip unnumbered ethernet0
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      encapsulation ppp
     </strong>
     （封装协议）（不能封装成 hdlc）
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      async default ip address 202.112.7.129（async default ip address+端口 IP）
     </strong>
     （绑定端口）
    </p>
    <p>
     Router-xh(config-if)# async dynamic routing
    </p>
    <p>
     Router-xh(config-if)# async mode interactive
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      no shutdown
     </strong>
    </p>
    <p>
     （2）配置同步串行接口
    </p>
    <p>
     接口类型为
     <strong>
      s（Serial）
     </strong>
     ：主要
     <strong>
      用户 DDN 专线、帧中继、卫星、微波等广域网连接，带宽 2048kbps
     </strong>
     。
    </p>
    <p>
     Router-xh(config)#
     <strong>
      interface s1
     </strong>
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      description
     </strong>
     To-shenzhen
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      bandwidth 2048（带宽为 2M，此处用 1024 作为进率）
     </strong>
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      ip address 202.112.7.129 255.255.255.252（ip address+端口 IP+子网掩码）
     </strong>
    </p>
    <p>
     Router-xh(config-if)#encapsulation
     <strong>
      hdlc
     </strong>
     （可支持 ppp/hdlc）
    </p>
    <p>
     Router-xh(config-if)# no ip directed-broadcast
    </p>
    <p>
     Router-xh(config-if)#no ip proxy-arp
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      no shutdown
     </strong>
    </p>
    <p>
     （3）配置 POS 接口
    </p>
    <p>
     ① POS（Packet over SONET/SDH）是一种利用 SONET/SDH 提供的高速传输通道直接传送 IP 数据包的技术， 同时它也是一种高速、先进的广域网连接技术。
    </p>
    <p>
     ② POS 使用的链路层协议主要有 PPP 和 HDLC。目前 POS 可以提供 155Mbit/s、622 Mbit/s、2.5 Gbit/s 和 10 Gbit/s 等多种传输速率的接口。
    </p>
    <p>
     POS 接口的配置任务包括：接口带宽、接口地址、接口的链路层协议】接口的帧格式、接口的 CRC 校验和 flag（帧头中净负荷类型的标志位）
    </p>
    <p>
     1、
     <strong>
      POS 可选的帧格式和对应标志位如下：
     </strong>
    </p>
    <table>
     <thead>
      <tr>
       <th align="center">
        帧格式
       </th>
       <th align="center">
        标志位
       </th>
      </tr>
     </thead>
     <tbody>
      <tr>
       <td align="center">
        sonet
       </td>
       <td align="center">
        s1s0 0
       </td>
      </tr>
      <tr>
       <td align="center">
        sdh
       </td>
       <td align="center">
        s1s0 2
       </td>
      </tr>
     </tbody>
    </table>
    <p>
     2、POS 可选的
     <strong>
      crc 校验位
     </strong>
     是
     <strong>
      16
     </strong>
     和
     <strong>
      32
     </strong>
     （默认）；
    </p>
    <p>
     在全局配置模式下，配置操作如下**（配置语句要求会书写）**：
    </p>
    <p>
     Router-xh(config)#interface POS0/1
    </p>
    <p>
     Router-xh(config-if)#description To-lab5
    </p>
    <p>
     Router-xh(config-if)#bandwidth
     <strong>
      10000000
     </strong>
     （考点1：带宽）
    </p>
    <p>
     Router-xh(config-if)#ip address
     <strong>
      192.168.5.1 255.255.255.252
     </strong>
     （考点2：IP地址+子网掩码）
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      crc 16
     </strong>
     （考点3：校验位）
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      pos framing sonet
     </strong>
     （考点4：帧格式）
    </p>
    <p>
     Router-xh(config-if)#np ip directed-broadcast
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      pos flag s1s0 0
     </strong>
     （考点5：帧格式对应校验位）
    </p>
    <p>
     Router-xh(config-if)#
     <strong>
      no shutdown
     </strong>
     （考点6：打开/关闭端口）
    </p>
    <h4>
     <a id="44_Loopback__529">
     </a>
     4.4 Loopback
     <strong>
      接口的配置
     </strong>
    </h4>
    <p>
     环回（loopback）接口是一种应用最为广法的
     <strong>
      虚接口
     </strong>
     ，loopback 接口号有效值位 0~2147483647，主要用于网络管理。
    </p>
    <p>
     网络管理员为 loopback 接口分配一个 IP 地址作为管理地址，其掩码应为
     <strong>
      255.255.255.255
     </strong>
     。 Loopback 接口不会关闭，总是处于激活状态。
    </p>
    <p>
     Loopback 接口的参数配置比较简单，主要配置 IP 地址。
    </p>
    <p>
     在全局配置模式下：
    </p>
    <p>
     Router-xh(config)#interface
     <strong>
      loopback 0
     </strong>
    </p>
    <p>
     Router-xh(config-if)#ip address 192.168.100.1
     <strong>
      255.255.255.255
     </strong>
     （ 配置接口 IP 地址（题干会提供）和掩码，注意环回接口地址的 掩码一般为 4 个 255）
    </p>
    <p>
     Router-xh(config-if)#no ip route-cache（禁用 route-cache 功能）
    </p>
    <p>
     Router-xh(config-if)#no ip mroute-cache
    </p>
    <p>
     Router-xh(config-if)#exit Router-xh(config)#exit
    </p>
    <p>
     Router#
    </p>
    <h3>
     <a id="5__553">
     </a>
     5. 路由器的静态路由配置
    </h3>
    <h4>
     <a id="51__555">
     </a>
     5.1
     <strong>
      静态路由概念
     </strong>
    </h4>
    <p>
     静态路由是指由网络管理员手工配置的路由信息，使用静态路由协议时，路由器不能根据网络的实际情况动态 地进行路由选择。当网络的拓扑结构或链路的状态发生变化时，也无法动态地更新路由表，必须由网络管理员手动 去修改路由表中相关的静态路由信息。因此它适合规模较小，网络拓扑结构没有变化的局域网和采用点到点方式连 接的较为简单的网络互连环境。
    </p>
    <h4>
     <a id="52__559">
     </a>
     5.2
     <strong>
      静态路由配置命令
     </strong>
    </h4>
    <p>
     静态路由使用“
     <strong>
      ip route
     </strong>
     ”命令在全局配置模式下配置，使用“
     <strong>
      no ip route
     </strong>
     ”命令可删除静态路由配置。静态路 由配置的命令格式如下：
    </p>
    <p>
     命令格式：
     <strong>
      ip route &lt;目的网络地址&gt;&lt;子网掩码&gt;&lt;下一跳路由器的 IP 地址&gt;
     </strong>
    </p>
    <p>
     Router-xh(config)#ip route 10.0.0.0 255.0.0.0 192.168.2.123
    </p>
    <p>
     <strong>
      其中，默认路由的静态配置方式为：
     </strong>
    </p>
    <p>
     <strong>
      ip route 0.0.0.0 0.0.0.0 下一跳路由器的 IP 地址（找图中直接与当前路由器相连的那个端口的IP地址即可）
     </strong>
    </p>
    <h3>
     <a id="6__573">
     </a>
     6. 动态路由协议配置
    </h3>
    <h4>
     <a id="61_RIP__575">
     </a>
     6.1 RIP
     <strong>
      的基本配置
     </strong>
    </h4>
    <p>
     RIP 动态路由协议的配置注意包括：在路由器上启动 RIP 协议，开始 RIP 进程，设置参与 RIP 路由的网络地址， 配置被动接口（passive-interface）等。
    </p>
    <p>
     基本配置如下：
    </p>
    <p>
     Router(config)#
     <strong>
      router rip
     </strong>
    </p>
    <p>
     Router(config-router)#
     <strong>
      network 159.105.0.0
     </strong>
    </p>
    <p>
     Router(config-router)#
     <strong>
      network 212.201.6.0
     </strong>
    </p>
    <p>
     RIP 的高级配置：配置被动接口
    </p>
    <p>
     Router(config)#router rip
    </p>
    <p>
     Router(config-router)#passive-interface Ethernet0
    </p>
    <h4>
     <a id="62_OSPF__593">
     </a>
     6.2 OSPF
     <strong>
      的基本配置
     </strong>
    </h4>
    <p>
     ① Router ospf：该命令用来启动 OSPF 进程，命令格式为“
     <strong>
      Router ospf&lt;Process ID&gt;
     </strong>
     ”
    </p>
    <p>
     其中 Process ID（PID）是 OSPF 的进程号，它的范围是 1~65535。
    </p>
    <p>
     ② network：该命令用来定参与定义 OSPF 的子网地址。
    </p>
    <p>
     命令格式：
     <strong>
      network &lt;子网地址&gt;&lt;子网掩码反码&gt;area&lt;区域号&gt;
     </strong>
    </p>
    <p>
     其中子网掩码反码的计算方法为，将子网掩码表示成二进制，然后各位取反，再转成十进制
    </p>
    <p>
     其中区域号一般为0
    </p>
    <p>
     Router-xh(config)#router ospf 10
    </p>
    <p>
     Router-xh(config-router)#
     <strong>
      network 192.168.1.0 0.0.0.255 area 0
     </strong>
    </p>
    <p>
     Router-xh(config-router)#exit
    </p>
    <p>
     在
     <strong>
      单个 IP 地址
     </strong>
     参与 OSPF 时，反掩码 0.0.0.0
    </p>
    <p>
     Router-xh(config)#router ospf 10
    </p>
    <p>
     Router-xh(config-router)#
     <strong>
      network 192.168.1.0 0.0.0.0 area 0
     </strong>
    </p>
    <p>
     Router-xh(config-router)#exit
    </p>
    <p>
     ③ range：该命令用于定义某一特定范围子网地址。
    </p>
    <p>
     命令格式：
     <strong>
      area&lt;区域号&gt;range&lt;子网地址&gt;&lt;子网掩码&gt;
     </strong>
    </p>
    <p>
     Router-xh(config)# router ospf 10
    </p>
    <p>
     Router-xh(config-router)#
     <strong>
      area 0 range 212.37.123.0 255.255.255.0
     </strong>
    </p>
    <p>
     Router-xh(config-router)#exit
    </p>
    <h3>
     <a id="7___DHCP__633">
     </a>
     7.
     <strong>
      路由器
     </strong>
     <strong>
      DHCP
     </strong>
     <strong>
      的配置
     </strong>
    </h3>
    <p>
     设置为 DHCP 服务器，在路由器上需要完成的配置任务主要是建立 IP 地址，池（Pool）和配置 IP 地址池的相 关参数。首先需要配置的是 IP 地址池的名称，再进入 DHCP 地址池配置模式，在该模式下对 DHCP 进行配置，主要任务包括：
     <strong>
      IP 地址池的子网地址和子网掩码、默认网关、域名和域名服务器 IP 地址、IP 地址租用时间
     </strong>
     等配置。
    </p>
    <p>
     （1）IP 地址池的建立。
    </p>
    <p>
     配置方法为在
     <strong>
      全局配置模式
     </strong>
     下使用“
     <strong>
      ip dhcp pool &lt;name&gt;
     </strong>
     ”命令为地址池赋予一个名称，其中**&lt;name&gt;是为所建的地址池提供的名称，可以是一组字符串或数字**。
    </p>
    <p>
     Router-xh(config)#ip dhcp pool 123（建立名为 123 的地址池）
    </p>
    <p>
     Router-xh(dhcp-config)#
    </p>
    <p>
     （2）配置 IP 地址池的子网地址与子网掩码。
    </p>
    <p>
     IP 地址池建立后，便进入地址池配置模式，在该模式下可进行 IP 子网地址和子网掩码的配置，用于设定 DHCP服务器可以分配的 IP 地址的范围。
    </p>
    <p>
     配置的方法是在 IP 地址池配置模式下，执行“
     <strong>
      network&lt;网络地址&gt;&lt;子网掩码&gt;
     </strong>
     ”命令，其中，&lt;子网掩码&gt;可 采用
     <strong>
      标准的子网掩码
     </strong>
     表示（如 255.255.255.0）或使用
     <strong>
      掩码前缀长度
     </strong>
     表示（如/24）。
    </p>
    <p>
     Router-xh(dhcp-config)# network 192.168.1.0
     <strong>
      255.255.255.0
     </strong>
    </p>
    <p>
     Router-xh(dhcp-config)#
    </p>
    <p>
     上述命令也可以表示如下：
    </p>
    <p>
     Router-xh(dhcp-config)#network 192.168.1.0**/24**
    </p>
    <p>
     Router-xh(dhcp-config)#
    </p>
    <p>
     （3）排除不用于动态分配的 IP 地址。
    </p>
    <p>
     配置方法为
     <strong>
      在全局配置模式
     </strong>
     下，
    </p>
    <p>
     使用“
     <strong>
      ip dhcp excluded-address low-address [high-address]
     </strong>
     ”命令，其中“
     <strong>
      low-address [high-address]
     </strong>
     ”表示 要排除的 IP 地址的范围。
    </p>
    <p>
     ① 排除单个 IP 地址 192.168.1.11。
    </p>
    <p>
     Router-xh(config)# ip dhcp excluded-address 192.168.1.11
    </p>
    <p>
     Router-xh(config)#
    </p>
    <p>
     ② 排除从 192.168.1.1 到 192.168.1.10 的一段 IP 地址**（IP地址之间使用空格）**。
    </p>
    <p>
     Router-xh(config)# ip dhcp excluded-address 192.168.1.1 192.168.1.10
    </p>
    <p>
     Router-xh(config)#
    </p>
    <p>
     （4）配置默认网关。
    </p>
    <p>
     动态分配 IP 地址时，还需要同时为客户端指定默认网关，以便客户端 TCP/IP 协议正常工作。配置方法为在地 址池配置模式下，
    </p>
    <p>
     执行“
     <strong>
      default-router address [address2,……,address8]
     </strong>
     ”命令，
    </p>
    <p>
     其中默认网关的地址，最多可以设置 8 个。
    </p>
    <p>
     Router-xh(dhcp-config)#default-router 192.168.1.254
    </p>
    <p>
     Router-xh(dhcp-config)#
    </p>
    <p>
     （5）配置 IP 地址池的域名系统。
    </p>
    <p>
     <strong>
      域名服务器的配置
     </strong>
     方法为在地址池配置模式下使用“
     <strong>
      dns-server address
     </strong>
     ”命令，该命令允许最多配置 8 个域名 服务器地址，但是在实际应用中，域名服务器一般只有两个或三个；
    </p>
    <p>
     ① 配置 DNS。
    </p>
    <p>
     Router-xh(dhcp-config)#
     <strong>
      dns-server address 202.102.192.68
     </strong>
     （在地址池配置模式下）
    </p>
    <p>
     Router-xh(dhcp-config)#
    </p>
    <p>
     IP 地址池中
     <strong>
      客户端域名的配置
     </strong>
     方法为在 DHCP 地址池配置模式下，使用“
     <strong>
      domin-name &lt;name&gt;
     </strong>
     ”命令，其中&lt;name&gt;为指定的域名名称。
    </p>
    <p>
     ② 配置 DHCP 客户端域名。
    </p>
    <p>
     Router-xh(dhcp-config)#
     <strong>
      domin-name xueba.com
     </strong>
    </p>
    <p>
     Router-xh(dhcp-config)#
    </p>
    <p>
     （6）IP 地址租用时间。
    </p>
    <p>
     在 DHCP 地址池配置模式下，使用 **lease {day [hours] [minutes] | infinite}**命令，
    </p>
    <p>
     其中参数可以包含天数、小时数以及分秒数，还可以设置为
     <strong>
      永不过期（infinite）
     </strong>
     。
    </p>
    <p>
     Router-xh(dhcp-config)#
     <strong>
      lease 0 3（设置租用时间为 3 小时）
     </strong>
    </p>
    <p>
     Router-xh(dhcp-config)#lease infinite
    </p>
    <p>
     Router-xh(dhcp-config)#
    </p>
    <p>
     <strong>
      判断方法：
     </strong>
    </p>
    <p>
     ① 先比较各个选项的时间
    </p>
    <p>
     ② 在比较各个选项的排除地址（书写，是否使用空格）
    </p>
    <p>
     ③ 看排除地址是不是在全局模式下
    </p>
    <p>
     ④ 看是否存在多个默认网关（默认路由）中间可以用逗号
    </p>
    <p>
     ⑤ 注意配置IP地址池中使用的是子网掩码并不是子网掩码反码（只有OSPF中使用）
    </p>
    <h3>
     <a id="8_IP_735">
     </a>
     8. IP
     <strong>
      访问控制列表的功能及其配置
     </strong>
    </h3>
    <h4>
     <a id="81_IP__737">
     </a>
     8.1 IP
     <strong>
      访问控制列表功能
     </strong>
    </h4>
    <p>
     访问控制列表（Access Control List，ACL）
     <strong>
      通过在路由器接口处控制路由数据包是被转发还是被阻塞来过滤网 络通信流量
     </strong>
     。路由器根据 ACL 中指定的条件来检测通过路由器的每个数据包，从而决定是转发还是丢弃该数据包。
     <strong>
      （作用：过滤数据包）
     </strong>
    </p>
    <h4>
     <a id="82_IP__741">
     </a>
     8.2 IP
     <strong>
      访问控制列表的分类
     </strong>
    </h4>
    <p>
     <strong>
      标准访问控制列表，只能检查数据包的源地址
     </strong>
     ，根据源网络、子网或者主机的 IP 地址来决定数据包的过滤。
    </p>
    <p>
     标准访问控制列表的表号是
     <strong>
      1-99
     </strong>
     。后来又进行了扩展，扩展的表号是 1300-1999。
    </p>
    <p>
     <strong>
      扩展访问控制列表，可以检查数据包的源地址和目的地址
     </strong>
     ，限据源网络或者目的网络、子网、主机的IP地址决定数据包的过滤操作。
    </p>
    <p>
     扩展访问控制列表除了检查源地址和目的地址外，还可以
     <strong>
      检查指定的协议
     </strong>
     ，根据数据包头中的协议类型进行过滤，比如
     <strong>
      IP协议，ICMP协议、TCPP协议和UDP协议
     </strong>
     等。
    </p>
    <p>
     扩展访问控制列表的表号是
     <strong>
      100-199
     </strong>
     ,扩展的表号是2000-2699
    </p>
    <h4>
     <a id="83__IP__753">
     </a>
     8.3
     <strong>
      配置
     </strong>
     IP
     <strong>
      访问控制列表
     </strong>
    </h4>
    <p>
     IP 访问控制列表是一个连续的列表，至少由**一个“permit（ 允许）”语句和一个或多个“deny（ 拒绝）”**语句组成。
    </p>
    <p>
     IP 访问控制列表用**名字（name）或表号（number）**标识和引用；
    </p>
    <p>
     在配置 IP 访问控制列表的首要任务就是使用“access-list”或“ip access-lint”命令，定义一个访问控制列表；
    </p>
    <p>
     access-list 命令要求只能使用
     <strong>
      表号
     </strong>
     标识列表，而 ip access-list 命令可以使用
     <strong>
      表号或者名字
     </strong>
     标识列表；
    </p>
    <ul>
     <li>
      <p>
       在配置过滤规则时，
       <strong>
        ACL 语句顺序很重要
       </strong>
       ；
      </p>
     </li>
     <li>
      <p>
       路由器执行 ACL 是按照配置的访问控制列表中条件语句来决定的；
      </p>
     </li>
     <li>
      <p>
       数据包
       <strong>
        只有在跟第一个判断条件不匹配时，才能被交给 ACL 中下一个条件语句进行比较
       </strong>
       ；
      </p>
     </li>
     <li>
      <p>
       若要允许“202.204.4.2”以外的所有源地址通过路由器，这时就需要先配置“deny 202.204.4.2”在配置 “permit any any” ，如果先执行允许语句，他就不会再拒绝202.204.4.2
      </p>
     </li>
     <li>
      <p>
       在通配符掩码位中，
       <strong>
        0 表示“检查数据包的 IP 地址相对应的比特位”，1 表示“不检查（忽略）数据包中的IP 地址相对应的比特位
       </strong>
       ”。
      </p>
     </li>
     <li>
      <p>
       通配符“
       <strong>
        any
       </strong>
       ”：代替 0.0.0.0 255.255.255.255，代表所有主机。
      </p>
     </li>
     <li>
      <p>
       通配符
       <strong>
        host
       </strong>
       ：与整个 IP 主机地址的所有位相匹配，可以使用缩写字“host”
      </p>
      <p>
       例如：Router(config)# access-list 1 deny 172.33.160.29 0.0.0.0
      </p>
      <p>
       等于：Router(config)# access-list 1 deny host 172.33.160.29
      </p>
     </li>
    </ul>
    <p>
     （1）使用 access-list 命令
    </p>
    <p>
     ① 配置 ACL
    </p>
    <p>
     access-list 用
     <strong>
      表号
     </strong>
     区分，标准（1-99）ACL 仅针对源进行控制，扩展（100-199）ACL 针对源、目标、某种协议、 端口号进行控制。
    </p>
    <p>
     标准：
     <strong>
      access-list 表号{permit | deny}源地址+源反码
     </strong>
    </p>
    <p>
     扩展：**access-list 表号{permit | deny}协议+源地址+源反码+目的地址+目的反码+操作+端口号。**其中，operator（操作）有 lt（小于）、gt（大于）、eq（等于）、neq（不等于）几种；operand 指的是端口号。
    </p>
    <p>
     ② 应用到接口
    </p>
    <p>
     命令格式：
     <strong>
      ip access-group &lt;表号&gt; {in | out}
     </strong>
    </p>
    <p>
     其中 access-list-number 指出连接到这个接口的访问控制列表表号；
     <strong>
      in|out 指示该 ACL 是应用到入站接口还是出站接口
     </strong>
     。
    </p>
    <p>
     如果 in 和 out 都没有指定，那么
     <strong>
      默认地认为是 out
     </strong>
     。
    </p>
    <p>
     例：拒绝转发所有 IP 地址进出的、端口号位 1433 的 UDP 协议数据包。
    </p>
    <p>
     在全局配置模式下：
    </p>
    <p>
     Router(config) #access-list 130 deny udp any any eq 1433
    </p>
    <p>
     Router(config) #access-list 130 permit ip any any Router(config) #
    </p>
    <p>
     配置应用接口：
    </p>
    <p>
     Router(config) #interface g0/1
    </p>
    <p>
     Router(config-if) #ip access-group 130 in
    </p>
    <p>
     Router(config-if) #ip access-group 130 out
    </p>
    <p>
     Router(config-if) #
    </p>
    <p>
     （2）使用 ip access-list 命令
    </p>
    <p>
     Ip access-list 用 standard | extended 区分，标准（1-99）ACL 仅对源进行控制、扩展（100-199）ACL 针对源、 目标、某种协议、端口号进行控制。
    </p>
    <p>
     1、
     <strong>
      ip access-list {standard | extended}表号|表名
     </strong>
    </p>
    <p>
     其中，standard | extended 分别表示访问控制列表的类别（标准|扩展）
    </p>
    <p>
     2、（
     <strong>
      标准 ACL）：permit | deny 协议+源地址+源反码
     </strong>
    </p>
    <p>
     <strong>
      （扩展 ACL）：permit | deny 协议+源地址+源反码+目的地址+目的反码+操作+端口号
     </strong>
    </p>
    <p>
     在扩展或标准访问控制模式下（如：Router(config-ext-nacl)#），配置过滤规则
    </p>
    <p>
     例：拒绝转发所有 IP 地址进与出方向的、端口号位 1437 的 UDP 协议数据包。
    </p>
    <p>
     在全局配置模式下：
    </p>
    <p>
     Router(config) #ip access-list extended 130|test（进入扩展访问控制列表配置模式）
    </p>
    <p>
     Router(config-ext-nacl) #
    </p>
    <p>
     Router(config-ext-nacl) #deny udp any any eq 1437
    </p>
    <p>
     Router(config-ext-nacl) #permit ip any any
    </p>
    <p>
     Router(config-ext-nacl) #
    </p>
    <p>
     配置应用接口：
    </p>
    <p>
     Router(config) #interface g0/1
    </p>
    <p>
     Router(config-if) #ip access-group 130|test in
    </p>
    <p>
     Router(config-if) #ip access-group 130|test out
    </p>
    <p>
     Router(config-if) #
    </p>
   </div>
   <link href="../../assets/css/markdown_views-a5d25dd831.css" rel="stylesheet"/>
   <link href="../../assets/css/style-e504d6a974.css" rel="stylesheet"/>
  </div>
 </article>
 <p alt="68747470733a2f:2f626c6f672e6373646e2e6e65742f54616e6563696f75732f:61727469636c652f64657461696c732f313436313132383433" class_="artid" style="display:none">
 </p>
</div>


